#include<iostream>
#include<string>
using namespace std;

void Food(float sex, float goal, float weight) {
	float uglevod;
	if (sex == 1 && goal == 1){
		uglevod = 2;
	}
    if (sex == 1 && goal == 2){
		uglevod = 5;
	}
    if (sex == 2 && goal == 1){
		uglevod = 0.5;
	}
    if (sex == 2 && goal == 2){
		uglevod = 3;
	}

	//--------------------------------------------------- белки
	float belki;
	if (sex == 1 && goal == 1){
		belki = 2;
	}
    if (sex == 1 && goal == 2){
		belki = 3;
	}
    if (sex == 2 && goal == 1){
		belki = 1.5;
	}
    if (sex == 2 && goal == 2){
		belki = 2.5;
	}

	cout << endl << "\tСупер! Поговорим о питании..." << endl;
	cout << "В сутки Вам нужно потреблять:" << endl;
	cout << "\tБелков: " << weight * belki << "г." << endl;
	cout << "\tУглеводов: " << weight * uglevod << "г." << endl;
	cout << "\tЖиров: " << weight * 0.5 << "г." << endl;
}

//------------------------------------------------------------------Тренировки для М
void TrainingsForMen(int goal, int days, int experiance) {
	int times;
	int repits;
	if (goal == 1) {
		switch (experiance) {
		case 1: times = 2;
			repits = 15;
			break;
		case 2:  times = 3;
			repits = 20;
			break;
		case 3: times = 3;
			repits = 25;
			break;
		}
		switch (days) {

		case 3: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 45 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 45 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tКардио 45 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		case 4: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:" << endl << "\t\tКардио 15 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин"
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\nЧередуйте эти дни!"
			<< endl;
			break;
		case 5: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:" << endl << "\t\tКардио 15 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин"
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 5й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\nt\tКардио 30 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		case 6: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 2й:" << endl << "\t\tКардио 15 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин"
			<< "\n\tДень 5й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень 6й:"
			<< "\n\t\tКардио 15 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tПроходка с гантелями " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;

		}
	}
	else {
		switch (experiance) {
		case 1: times = 2;
			repits = 15;
			break;
		case 2:  times = 3;
			repits = 12;
			break;
		case 3: times = 3;
			repits = 10;
			break;
		}
		switch (days) {
		case 2:cout<< "Следуйте этому плану тренировок:" 
			<< "\n\tДень 1й:" << endl << "\t\tКардио 5 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\n\t\tКардио 5 мин"
			<< "\n\nЧередуйте эти дни!" 
			<< endl;
			break;
		case 3:  cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:" << endl << "\t\tКардио 5 мин."
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<<  "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
	        << "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		case 4:  cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:" << endl << "\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tРозгибания ног сидя " << times << "Х" << repits
			<< "\n\t\tСгибания ног лежа " << times << "Х" << repits
			<< "\n\t\tИкры " << times << "Х" << repits
		    << "\n\t\tКардио 5 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом " << times << "Х" << repits
			<< "\n\t\tРазводка под углом " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tМахи гантелей через стороны " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока за голову " << times << "Х" << repits
			<< "\n\t\tЗадний пучек дельт " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tСгибания рук на наклонной скамье " << times << "Х" << repits
			<< "\n\t\tМолотки с гантелями стоя одновременно " << times << "Х" << repits
			<< "\n\t\tФранцузкий жим лежа с гантелями " << times << "Х" << repits
			<< "\n\t\tРазгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		case 5:  cout << "Следуйте этому плану тренировок:" 
			<< "\n\tДень 1й:" << endl << "\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tРозгибания ног сидя " << times << "Х" << repits
			<< "\n\t\tСгибания ног лежа " << times << "Х" << repits
			<< "\n\t\tИкры " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tЖим штанги сидя " << times << "Х" << repits
			<< "\n\t\tТяга штанги к подбородку " << times << "Х" << repits
			<< "\n\t\tМахи гантелей через стороны " << times << "Х" << repits
			<< "\n\t\tЗадний пучек дельт " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом " << times << "Х" << repits
			<< "\n\t\tРазводка под углом " << times << "Х" << repits
			<< "\n\t\tБрусья широким хватом 3 Х MAX"
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока за голову " << times << "Х" << repits
			<< "\n\t\tРычажная тяга " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 5й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tСгибания рук на наклонной скамье " << times << "Х" << repits
			<< "\n\t\tМолотки с гантелями стоя одновременно " << times << "Х" << repits
			<< "\n\t\tФранцузкий жим лежа с гантелями " << times << "Х" << repits
			<< "\n\t\tРазгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		case 6:  cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень 1й:" << endl << "\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами " << times << "Х" << repits
			<< "\n\t\tРозгибания ног сидя " << times << "Х" << repits
			<< "\n\t\tСгибания ног лежа " << times << "Х" << repits
			<< "\n\t\tИкры " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 2й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tЖим штанги сидя " << times << "Х" << repits
			<< "\n\t\tТяга штанги к подбородку " << times << "Х" << repits
			<< "\n\t\tМахи гантелей через стороны " << times << "Х" << repits
			<< "\n\t\tЗадний пучек дельт " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 3й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tЖим штанги лежа " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом " << times << "Х" << repits
			<< "\n\t\tРазводка под углом " << times << "Х" << repits
			<< "\n\t\tБрусья широким хватом 3 Х MAX"
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 4й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПодтягивания " << times << "Х" << "max"
			<< "\n\t\tТяго гор. блока к груди " << times << "Х" << repits
			<< "\n\t\tТяга верт. блока за голову " << times << "Х" << repits
			<< "\n\t\tРычажная тяга " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 5й:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПресс " << times << "Х" << repits
			<< "\n\t\tСгибания рук на наклонной скамье " << times << "Х" << repits
			<< "\n\t\tМолотки с гантелями стоя одновременно " << times << "Х" << repits
			<< "\n\t\tФранцузкий жим лежа с гантелями " << times << "Х" << repits
			<< "\n\t\tРазгибания рук на блоке  " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин"
			<< "\n\tДень 6й:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\nЧередуйте эти дни!" << endl;
			break;
		
		}
	}
}
// -------------------------------------------------------------Тренировки для Ж
void TrainingsForWeman(int goal, int days,int experiance) {
	int times;
	int repits;
	
	
	if (goal == 1) {
		switch (experiance) {
		case 1: times = 2;
			repits = 15;
			break;
		case 2:  times = 3;
			repits = 20;
			break;
		case 3: times = 3;
			repits = 25;
			break;
		}
		switch (days) {
			
		
		case 3: cout << "Следуйте этому плану тренировок:" 
			<<"\n\tДень первый:"
			<<"\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания + разгибание ног "<< times <<"Х"<< repits
			<< "\n\t\tЖим ногами + наклоны со штангой "<< times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
		<< "\n\tДень второй:"
			<< "\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
		<< "\n\tДень третий:"
			<< "\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
			<<"\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 4:cout<< "Следуйте этому плану тренировок:" 
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 30 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tКардио 30 мин."
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 5:cout<< "Следуйте этому плану тренировок:" 
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень пятый:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 6: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\tДень пятый:"
			<< "\n\t\tКардио 20 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания + разгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tПриседания + разгибание ног " << times << "Х" << repits
			<< "\n\t\tЖим ногами + наклоны со штангой " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову + сгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока + жим гантелей стоя " << times << "Х" << repits
			<< "\n\t\tКардио 20 мин."
			<< "\n\tДень шестой:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		
		}
	}
	else {
		switch (experiance) {
		case 1: times = 2;
			repits = 15;
			break;
		case 2:  times = 3;
			repits = 12;
			break;
		case 3: times = 3;
			repits = 10;
			break;
		}
		switch (days) {
			
		case 2:  cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами (стопы узко) " << times << "Х" << repits
			<< "\n\t\tСгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tРазгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tОтжимания широкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tСгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока " << times << "Х" << repits
			<< "\n\t\tРазгибания рук на блоке " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 3: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами (стопы узко) " << times << "Х" << repits
			<< "\n\t\tСгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tРазгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tМертвая тяга с гантелями " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tМахи гантелей в стороны " << times << "Х" << repits
			<< "\n\t\tОтведение гантелей в на задний пучек дельт " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтжимания широкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока на грудь " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом 45грд. " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока " << times << "Х" << repits
			<< "\n\t\tРазводка гантелей в наклоне " << times << "Х" << repits
			<< "\n\t\tгиперэкстензии " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tНаклоны со штангой на плечах " << times << "Х" << repits
			<< "\n\t\tСгибания рук с гантелями" << times << "Х" << repits
			<< "\n\t\tФранцузкий жим с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 4: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами (стопы узко) " << times << "Х" << repits
			<< "\n\t\tСгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tРазгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tМертвая тяга с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтжимания широкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом 45 грд. " << times << "Х" << repits
			<< "\n\t\tРазводка гантелей в наклоне " << times << "Х" << repits
			<< "\n\t\tЖим гантелей сидя " << times << "Х" << repits
			<< "\n\t\tМахи гантелей в стороны " << times << "Х" << repits
			<< "\n\t\tСгибания рук с гантелями " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tНаклоны со штангой на плечах " << times << "Х" << repits
			<< "\n\t\tЯгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tНаклоны со штангой на плечах " << times << "Х" << repits
			<< "\n\t\tЯгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 5: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами (стопы узко) " << times << "Х" << repits
			<< "\n\t\tСгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tРазгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tМгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания с узкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tФранцузкий жим с гантелями " << times << "Х" << repits
			<< "\n\t\tРазгибания рук в кроссовере " << times << "Х" << repits
			<< "\n\t\tСгибания рук со штангой стоя " << times << "Х" << repits
			<< "\n\t\tСгибания рук с гантелями на скамье в наклоне " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tНаклоны со штангой на плечах " << times << "Х" << repits
			<< "\n\t\tЯгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтжимания широкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом 45 грд. " << times << "Х" << repits
			<< "\n\t\tРазводка гантелей в наклоне " << times << "Х" << repits
			<< "\n\t\tСведение рук в тренажере сидя " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень пятый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока  " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову " << times << "Х" << repits
			<< "\n\t\tГиперэкстензии " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		case 6: cout << "Следуйте этому плану тренировок:"
			<< "\n\tДень первый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tПриседания со штангой " << times << "Х" << repits
			<< "\n\t\tЖим ногами (стопы узко) " << times << "Х" << repits
			<< "\n\t\tСгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tРазгибания ног в тренажере " << times << "Х" << repits
			<< "\n\t\tМгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень второй:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтжимания с узкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tФранцузкий жим с гантелями " << times << "Х" << repits
			<< "\n\t\tРазгибания рук в кроссовере " << times << "Х" << repits
			<< "\n\t\tСгибания рук со штангой стоя " << times << "Х" << repits
			<< "\n\t\tСгибания рук с гантелями на скамье в наклоне " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень третий:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tОтведения ноги на ягодицу с нижнего блока " << times << "Х" << repits
			<< "\n\t\tЖим ожной ногой " << times << "Х" << repits
			<< "\n\t\tВыпады назад " << times << "Х" << repits
			<< "\n\t\tНаклоны со штангой на плечах " << times << "Х" << repits
			<< "\n\t\tЯгодичный мостик " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\n Чередуйте эти дни!"
			<< "\n\tДень четвертый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20"
			<< "\n\t\tОтжимания широкой постановкой рук " << times << "Х" << repits
			<< "\n\t\tЖим гантелей под углом 45 грд. " << times << "Х" << repits
			<< "\n\t\tРазводка гантелей в наклоне " << times << "Х" << repits
			<< "\n\t\tСведение рук в тренажере сидя " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень пятый:"
			<< "\n\t\tКардио 5 мин."
			<< "\n\t\tПоднятие ног на брусьях 20 + тройная планка 30с. 3 подхода"
			<< "\n\t\tТяга вертикального блока на грудь " << times << "Х" << repits
			<< "\n\t\tТяга горизонтального блока  " << times << "Х" << repits
			<< "\n\t\tТяга вертикального блока за голову " << times << "Х" << repits
			<< "\n\t\tГиперэкстензии " << times << "Х" << repits
			<< "\n\t\tКардио 5 мин."
			<< "\n\tДень шестой:"
			<< "\n\t\tКардио 60 мин."
			<< "\n\n Чередуйте эти дни!"
			<< endl;
			break;
		
		}
	}
}

class FoodDetiles {
public:
           void PrintBelok() {
		cout << "Подробности продуктов БЕЛКА" << endl;
	}
           void PrintUglevody() {
		cout << "Подробности продуктов УГЛЕВОДОВ" << endl;
	}
	       void PrintJury() {
		cout << "Подробности продуктов ЖИРОВ" << endl;
	}
};

void main() {
	setlocale(LC_ALL, "RUS");
	cout << "\t\tПриветствую Вас !!!" << endl << endl;
                                                          // Выбор пола
	linkSex:
	cout  <<"Давай опредилим Ваш пол:"<<endl
		  <<"\tМужчина - 1"<<endl
		  <<"\tЖенщина - 2"<<endl;
    int sex;
	cout << "Введите ваш выбор_";
	cin >> sex;
	if (!(sex == 1 || sex == 2)) {
		cout << "\tОшибка!!! Попробуйте еще раз." << endl;
		goto linkSex;
	}

                                                           // Указание веса
	int weight;
	cout <<endl << "Укажите ваш вес в кг._";
	cin >> weight;

                                                            // Выбор цели
	linkGoal:
	cout << endl <<"Отлично! Теперь выберем цель:" << endl 
        		 <<"\tХудеть - 1" << endl 
		         <<"\tНабирать массу - 2" << endl;
    int goal;
	cout << "Введите ваш выбор_";
	cin >> goal;
	if (!(goal == 1 || goal == 2)) {
		cout << "\tОшибка!!! Попробуйте еще раз.";
		goto linkGoal;
	}


//************************************************************************Тренировки
// Выбор колличества тренировок в неделю 
	linkTrainingDays:
	cout <<endl<< "\tТеперь о тренировках!" << endl<<endl; // Выбор колличества тренировочных дней
	int trainingsInaWeek;
	if (goal==1)
	{
		cout << "При ваших целях Вы должны тренироваться от 3х до 6ти раз в неделю!" << endl
			 << "Сколько раз вы готовы тренироваться?_";
	}
	if (goal == 2)
	{
		cout << "При ваших целях Вы должны тренироваться от 2х до 6ти раз в неделю!" << endl
			<< "Сколько раз вы готовы тренироваться?_";
	}
	cin >> trainingsInaWeek;
	cout << endl;
//Проверка	
	if (goal == 2 && (trainingsInaWeek < 2 || trainingsInaWeek > 6)) {
		cout << "Недопустимое колличество тренировок! Попробуйте еще раз." << endl;
		goto linkTrainingDays;
	}
	if (goal == 1 && (trainingsInaWeek < 3 || trainingsInaWeek > 6)) {
		cout << "Недопустимое колличество тренировок! Попробуйте еще раз." << endl;
		goto linkTrainingDays;
	}

	int  experienceLevel=0;
	cout << "Выберите уровень вашей подготовленности(1-без опыта; 2-опыт от 3х месяцев; 3-опытный)";
	cin >> experienceLevel;

	cout << "##########################################################" << endl;
// Питание
	Food(sex, goal, weight);
	cout <<endl;
	
	int foodDetails;                                                      // О еде детатьнее
	cout << "Хотите рассмотреть питание детальнее? (Да - 1 Нет - 2) - ";
	cin >> foodDetails;
	
	if(foodDetails == 1) {
		cout << endl << "\t Узнать какие продукты содержат" << endl
			<< "\t\tБелок - \tнажмите 1" << endl
			<< "\t\tУглеводы - \tнажмите 2" << endl
			<< "\t\tЖиры - \t\tнажмите 3" << endl << endl
			<<"\t\tЧтоб пропустить - нажмите 0" << endl;
	int choseDetailFood, choseDetailFood2;
	cin >> choseDetailFood >> choseDetailFood2;

	FoodDetiles detailsOfFood;

	switch (choseDetailFood)
	{
	case 1: detailsOfFood.PrintBelok();
		break;
	case 2: detailsOfFood.PrintUglevody();
		break;
	case 3: detailsOfFood.PrintJury();
		break;
	}

	switch (choseDetailFood2)
	{
	case 1: detailsOfFood.PrintBelok();
		break;
	case 2: detailsOfFood.PrintUglevody();
		break;
	case 3: detailsOfFood.PrintJury();
		break;
	}
	};

	cout << endl;
// Тренировки для М
	if (sex == 1) 
		 TrainingsForMen(goal, trainingsInaWeek, experienceLevel);
// Тренировки для Ж
	else TrainingsForWeman(goal, trainingsInaWeek, experienceLevel);
}